class CRWLResponseCode():
    SUCCESS = 200


REGIONS = {'Москва': '1', 'Московская': '2', 'Санкт-Петербург': '191', 'Ленинградская': '192', 'Адыгея': '282',
           'Алтайский': '308', 'Амурская': '388', 'Архангельская': '406', 'Астраханская': '452', 'Башкортостан': '482',
           'Белгородская': '573', 'Брянская': '616', 'Бурятия': '662', 'Владимирская': '689', 'Волгоградская': '729',
           'Вологодская': '781', 'Воронежская': '815', 'Дагестан': '886', 'Еврейская': '950', 'Забайкальский': '962',
           'Ивановская': '1013', 'Ингушетия': '1046', 'Иркутская': '1060', 'Кабардино-Балкария': '1121',
           'Калининградская': '1153', 'Калмыкия': '1181', 'Калужская': '1192', 'Камчатский': '1229',
           'Карачаево-Черкесия': '1239', 'Карелия': '1264', 'Кемеровская': '1290', 'Кировская': '1344', 'Коми': '1397',
           'Костромская': '1434', 'Краснодарский': '1461', 'Красноярский': '1692', 'Крым': '2499', 'Курганская': '1768',
           'Курская': '1798', 'Липецкая': '1832', 'Магаданская': '1857', 'Марий': '1868', 'Мордовия': '1891',
           'Мурманская': '1924', 'Ненецкий': '1955', 'Нижегородская': '1958', 'Новгородская': '2046',
           'Новосибирская': '2067', 'Омская': '2118', 'Оренбургская': '2157', 'Орловская': '2210', 'Пензенская': '2232',
           'Пермский': '2276', 'Приморский': '2351', 'Псковская': '2415', 'Республика': '2442', 'Ростовская': '2451',
           'Рязанская': '2551', 'Самарская': '2584', 'Саратовская': '2648', 'Сахалинская': '2674', 'Саха': '2700',
           'Свердловская': '2748', 'Северная': '2865', 'Смоленская': '2895', 'Ставропольский': '2928',
           'Тамбовская': '3061', 'Татарстан': '3097', 'Тверская': '3153', 'Томская': '3195', 'Тульская': '3224',
           'Тыва': '3273', 'Тюменская': '3293', 'Удмуртия': '3336', 'Ульяновская': '3370', 'Хабаровский': '3408',
           'Хакасия': '3443', 'Ханты-Мансийский': '3464', 'Челябинская': '3504', 'Чеченская': '3572', 'Чувашия': '3593',
           'Чукотский': '3621', 'Ямало-Ненецкий': '3626', 'Ярославская': '3646'}

REAL_ESTATE_CATEGORIES = {'квартиры': 1, 'ком.недвижимость': 2, 'комнаты': 3, 'дома, дачи, коттеджи': 4}